/*
-----Задачи срочного выполнения:-----
1) Сокращенный ввод
2) Подсчет Нок
3) Переделать структуру хранения таблицы и способы различия четной и нечетной недель




-----Задачи средней важности:-----
2) Фиксить некорректный расчет пост-дополнительных пустых ячеек при выводе месяца
3) Рассылать расписание на сегодняшний/завтрашний день в группу
4) Оптимизация строк и обьектов Text в list.begin(). Сокращение их количества и увеличиваем повторное использование
5) Оптимизация алгоритмов вытаскивания чисел из строки путем оборачивания строк в Text (там есть метод .toInt())





-----Задачи долгосрочной перспективы:-----
1) ENABLE_SUBGPOUP - включает разделение группы на подгруппы, иначе - единая таблица, расписание и тд
2) По флагу в define организовать перевод интерфейса на школьный словарь ("в этот день пар нет" -> "в этот день уроков нет!")
3) Сделать логирования всех ошибок и предупреждений




*/