/*
-----Задачи срочного выполнения:-----
1) Сокращенный ввод
2) Подсчет Нок





-----Задачи средней важности:-----
1) Класс-таймер, удаляющий некоторые ненужные сообщения через опеределенное время
2) Фиксить некорректный расчет пост-дополнительных пустых ячеек при выводе месяца
3) Рассылать расписание на сегодняшний/завтрашний день в группу






-----Задачи долгосрочной перспективы:-----
1) ENABLE_SUBGPOUP - включает разделение группы на подгруппы, иначе - единая таблица, расписание и тд
2) По флагу в define организовать перевод интерфейса на школьный словарь ("в этот день пар нет" -> "в этот день уроков нет!")
3) Сделать логирования всех ошибок и предупреждений




*/